{"qid": "PDPA-QA-0075", "query": "Does PDPA say what details must be included in the policies organisations create?", "pos_id": "PDPA-12-0-35", "pos_text": "Policies and practices\nAn organisation must —\n(a) develop and implement policies and practices that are necessary for the organisation to meet the obligations of the organisation under this Act;\n(b) develop a process to receive and respond to complaints that may arise with respect to the application of this Act;\n(c) communicate to its staff information about the organisation’s policies and practices mentioned in paragraph (a); and\n(d) make information available on request about —\n(i) the policies and practices mentioned in paragraph (a); and\n(ii) the complaint process mentioned in paragraph (b).", "neg_id": "PDPA-48L-4-211", "neg_text": "Voluntary undertakings\nWhere an organisation or a person fails to comply with any undertaking in a voluntary undertaking —\n(a) the Commission may give the organisation or person concerned any direction that the Commission thinks fit in the circumstances to ensure the compliance of the organisation or person with that undertaking; and\n(b) section 48K(1), (3), (4), (5), (6) and (7) applies to the direction given under paragraph (a) as if the direction were given under section 48I.", "pos_citation": "PDPA s.12(0)", "neg_citation": "PDPA s.48L(4)"}
{"qid": "PDPA-QA-0124", "query": "If my access request is rejected, does the organisation need to tell me why?", "pos_id": "PDPA-21-6-74", "pos_text": "Access to personal data\nWhere —\n(a) an individual makes a request under subsection (1) to an organisation on or after 1 February 2021; and\n(b) the organisation, by reason of subsection (2) or (3), does not provide an individual with the individual’s personal data or other information requested under subsection (1),\nthe organisation must, within the prescribed time and in accordance with the prescribed requirements, notify the individual of the rejection.", "neg_id": "PDPA-59-1-285", "neg_text": "Preservation of secrecy\nSubject to subsection (5), every specified person must preserve, and aid in the preservation of, secrecy with regard to —\n(a) any personal data an organisation would be required or authorised to refuse to disclose if it were contained in personal data requested under section 21;\n(b) whether information exists, if an organisation in refusing to provide access under section 21 does not indicate whether the information exists;\n(c) all matters that have been identified as confidential under subsection (3); and\n(d) all matters relating to the identity of persons providing information to the Commission,\nthat may come to the specified person’s knowledge in the performance of the specified person’s functions and discharge of the specified person’s duties under this Act and must not communicate any such matter to any person, except insofar as such communication —\n(e) is necessary for the performance of any such function or discharge of any such duty; or\n(f) is lawfully required by any court, or lawfully required or permitted under this Act or any other written law.", "pos_citation": "PDPA s.21(6)", "neg_citation": "PDPA s.59(1)"}
